{
  "experiences": [
    {
      "company_name": "Unity Power Technology",
      "date_from": "2022",
      "date_to": "Present",
      "position": "TEAM LEAD SOFTWARE DEVELOPER",
      "descriptions": "Designed and implemented scalable microservices for a leading cryptocurrency exchange platform using Node.js and Golang. Crafted robust APIs for both mobile and web applications, utilizing Golang for improved performance and security. Collaborated with cross-functional teams to seamlessly integrate the API with the front-end using Vue. Enhanced API performance through optimized database queries and the implementation of effective caching techniques. Built a trading engine and exchange system, revolutionizing the Grambling System's trading experience."
    },
    {
      "company_name": "Consumer goods myanmar",
      "date_from": "Dec 2020",
      "date_to": "Oct 2021",
      "position": "JUNIOR QUALITY ASSURANCE",
      "descriptions": "Crafted comprehensive test plans and cases for each software release, utilizing advanced test design techniques to ensure thorough testing. Tracked and reported issues through a formal bug-tracking system, working closely with the engineering team to isolate, debug, and resolve bugs. Stayed up-to-date with industry systems testing tools and best practices. Clearly communicated test progress and results, as well as any defects, to provide clear and actionable insights."
    },
    {
      "company_name": "Vitosms bulk sms services",
      "date_from": "2021",
      "date_to": "2020",
      "position": "Web developer",
      "descriptions": "Optimized website performance using Laravel, HTML, CSS, and JS. Created web applications under guidance from senior team members, collaborating closely with the team lead. As a support agent for VitoSMS, a bulk SMS service provider serving over 200 clients around-the-clock, managed hardware and software training, and trained other help desk support agents on technical duties. Provided valuable insights and guidance to email and phone clients, helping them make informed software-pairing decisions based on their budget and specific needs."
    },
    {
      "company_name": "Tastysoft software co.,ltd",
      "date_from": "2018",
      "date_to": "2020",
      "position": "Web developer",
      "descriptions": "Developed a traveling website using PHP and elevated the user experience through the implementation of front-end technologies, including jQuery and Bootstrap. Conducted code reviews on GitHub for other developers and contributed to the creation of web applications under the guidance of senior team members and project managers. Collaborated closely with the team lead and actively participated in team efforts to drive project success."
    }
  ]
}
